app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "profile_img", "years", "disorder", "work_example", "work_URL", "story", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save

UPDATE "artists" SET "work_URL" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["work_URL", "https://res.cloudinary.com/dkhiieq9p/image/upload/v1597259883/91JlTPIUw8L._SS500__dmufhq.jpg"], ["updated_at", "2020-08-19 02:24:34.813015"], ["id", 34]]
---
  def update
    if @artist.update(artist_params)

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
def add_symptom
  @symptom = Symptom.new(symptom_params)
  @artist = Artist.find(params[:id])

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
def create
  @resource = Resource.new(resource_params)
  @artist = Artist.find(params[:artist_id])