app/controllers/resources_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "resources".* FROM "resources" WHERE "resources"."artist_id" = $1  [["artist_id", 11]]
---
  def index

    @artist = Artist.find(params[:artist_id])
    @resources = Resource.where(artist_id: @artist.id).all

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find(params[:artist_id])

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "resources" ("name", "link", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
def create
  @resource = Resource.new(resource_params)
  @artist = Artist.find(params[:artist_id])

  @artist.resources << @resource