app/controllers/symptoms_controller.rb

  def index
    @symptoms = Symptom.all
---
SELECT "symptoms".* FROM "symptoms"