app/controllers/symptoms_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."artist_id" = $1  [["artist_id", 11]]
---
  def index
    @artist = Artist.find(params[:artist_id])

    @symptoms = Symptom.where(artist_id: @artist.id).all

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "symptoms" ("name", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fatigue"], ["artist_id", 11], ["created_at", "2020-08-11 01:40:18.003098"], ["updated_at", "2020-08-11 01:40:18.003098"]]
INSERT INTO "symptoms" ("name", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "roar"], ["artist_id", 20], ["created_at", "2020-08-12 21:39:55.933733"], ["updated_at", "2020-08-12 21:39:55.933733"]]
---
def create
  @symptom = Symptom.new(symptom_params)
  @artist = Artist.find(params[:artist_id])

  @artist.symptoms << @symptom

  if @symptom.save

DELETE FROM "symptoms" WHERE "symptoms"."id" = $1  [["id", 12]]
---
def destroy
  @symptom.destroy

SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def set_symptom
      @symptom = Symptom.find(params[:id])